/*****************************************************************************/
/* osrfx2.c    A Driver for the OSR USB FX2 Learning Kit device              */
/*                                                                           */
/* Copyright (C) 2006 by Robin Callender                                     */
/*                                                                           */
/* This program is free software. You can redistribute it and/or             */
/* modify it under the terms of the GNU General Public License as            */
/* published by the Free Software Foundation, version 2.                     */
/*                                                                           */
/*****************************************************************************/

#include <linux/version.h>
#include <linux/kernel.h>
#include <linux/errno.h>
#include <linux/init.h>
#include <linux/slab.h>
#include <linux/module.h>
#include <linux/kref.h>
#include <linux/poll.h>
#include <asm/uaccess.h>
#include <linux/usb.h>

/*****************************************************************************/
/* Define the vendor id and product id.                                      */
/*****************************************************************************/
#define VENDOR_ID   0x0547       
#define PRODUCT_ID  0x1002

#define DEVICE_MINOR_BASE   192
             
#undef TRUE
#define TRUE  (1)
#undef FALSE
#define FALSE (0)

/*****************************************************************************/
/* Define the vendor commands supported by OSR USB FX2 device.               */
/*****************************************************************************/
#define OSRFX2_READ_7SEGMENT_DISPLAY      0xD4
#define OSRFX2_READ_SWITCHES              0xD6
#define OSRFX2_READ_BARGRAPH_DISPLAY      0xD7
#define OSRFX2_SET_BARGRAPH_DISPLAY       0xD8
#define OSRFX2_IS_HIGH_SPEED              0xD9
#define OSRFX2_REENUMERATE                0xDA
#define OSRFX2_SET_7SEGMENT_DISPLAY       0xDB
              
/*****************************************************************************/
/* BARGRAPH_STATE is a bit field structure with each bit corresponding       */
/* to one on the bars on the bargraph LED of the OSR USB FX2 Learner Kit     */
/* development board.                                                        */
/*****************************************************************************/
struct bargraph_state {
    union {
        struct {
            /*
             * Individual bars (LEDs) starting from the top of the display.
             *
             * NOTE: The display has 10 LEDs, but the top two LEDs are not
             *       connected (don't light) and are not included here. 
             */
            unsigned char Bar4 : 1;
            unsigned char Bar5 : 1;
            unsigned char Bar6 : 1;
            unsigned char Bar7 : 1;
            unsigned char Bar8 : 1;
            unsigned char Bar1 : 1;
            unsigned char Bar2 : 1;
            unsigned char Bar3 : 1;
        };
        /*
         *  The state of all eight bars as a single octet.
         */
        unsigned char BarsOctet;
    };
} __attribute__ ((packed));

/*****************************************************************************/
/* SEGMENT_STATE is a bit field structure with each bit corresponding        */
/* to one on the segments on the 7-segment display of the OSR USB FX2        */
/* Learner Kit development board.                                            */
/*****************************************************************************/
struct segment_state {
    union {
        struct {
            /*
             * Individual segments.
             */
            unsigned char Segment_top         : 1;   /* 0x01 */
            unsigned char Segment_upper_right : 1;   /* 0x02 */
            unsigned char Segment_lower_right : 1;   /* 0x04 */
            unsigned char Segment_dot         : 1;   /* 0x08 */
            unsigned char Segment_lower_left  : 1;   /* 0x10 */
            unsigned char Segment_middle      : 1;   /* 0x20 */
            unsigned char Segment_upper_left  : 1;   /* 0x40 */
            unsigned char Segment_bottom      : 1;   /* 0x80 */
        };
        /*
         *  The state of all the segments as a single octet.
         */
        unsigned char SegmentsOctet;
    };
} __attribute__ ((packed));

static const unsigned char digit_to_segments [10] = { 
    0xD7,  /* 0 */
    0x06,  /* 1 */
    0xB3,  /* 2 */
    0xA7,  /* 3 */
    0x66,  /* 4 */
    0xE5,  /* 5 */
    0xF5,  /* 6 */
    0x07,  /* 7 */
    0xF7,  /* 8 */
    0x67   /* 9 */
};

static const unsigned char nondisplayable = 0x08;   /* the "dot" segment */
static const unsigned char high_speed     = 0x76;   /* high-speed "H" */
static const unsigned char power_active   = 0x77;   /* PM active "A" */
static const unsigned char power_suspend  = 0xE5;   /* PM suspend "S" */

/*****************************************************************************/
/* SWITCHES_STATE is a bit field structure with each bit corresponding       */
